package com.sunzn.utils.library;

import android.content.Context;
import android.graphics.Color;
import android.support.v4.content.ContextCompat;

/**
 * Created by sunzn on 2016/12/9.
 */

public class ColorUtils {

    private ColorUtils() {
        super();
    }

    /**
     * ╔════════════════════════════════════════════════════════════════════════════════════════════
     * ║ 名称：获取颜色值
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 参数：color
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 返回：int
     * ╚════════════════════════════════════════════════════════════════════════════════════════════
     */
    public static int getColor(String color) {
        return Color.parseColor(color);
    }

    /**
     * ╔════════════════════════════════════════════════════════════════════════════════════════════
     * ║ 名称：获取颜色值
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 参数：context
     * ║ 参数：color
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 返回：int
     * ╚════════════════════════════════════════════════════════════════════════════════════════════
     */
    public static int getColor(Context context, int color) {
        return ContextCompat.getColor(context, color);
    }

}
