package com.sunzn.utils.library;

import java.io.UnsupportedEncodingException;
import java.net.URLDecoder;
import java.net.URLEncoder;

/**
 * Created by sunzn on 2018/4/9.
 */

public class URLUtils {

    private URLUtils() {
        throw new RuntimeException("Stub!");
    }

    /**
     * ╔════════════════════════════════════════════════════════════════════════════════════════════
     * ║ 名称：URL 编码
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 参数：input 要编码的字符
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 返回：编码为 UTF-8 的字符串
     * ╚════════════════════════════════════════════════════════════════════════════════════════════
     */
    public static String encode(String input) {
        return encode(input, "UTF-8");
    }

    /**
     * ╔════════════════════════════════════════════════════════════════════════════════════════════
     * ║ 名称：URL 编码
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 参数：input   要编码的字符
     * ║ 参数：charset 字符集
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 返回：编码为字符集的字符串，若系统不支持指定的编码字符集，则直接将 input 原样返回
     * ╚════════════════════════════════════════════════════════════════════════════════════════════
     */
    public static String encode(String input, String charset) {
        try {
            return URLEncoder.encode(input, charset);
        } catch (UnsupportedEncodingException e) {
            return input;
        }
    }

    /**
     * ╔════════════════════════════════════════════════════════════════════════════════════════════
     * ║ 名称：URL 解码
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 参数：input 要解码的字符串
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 返回：URL 解码后的字符串
     * ╚════════════════════════════════════════════════════════════════════════════════════════════
     */
    public static String decode(String input) {
        return decode(input, "UTF-8");
    }

    /**
     * ╔════════════════════════════════════════════════════════════════════════════════════════════
     * ║ 名称：URL 解码
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 参数：input   要解码的字符串
     * ║ 参数：charset 字符集
     * ╟────────────────────────────────────────────────────────────────────────────────────────────
     * ║ 返回：URL 解码为指定字符集的字符串，若系统不支持指定的解码字符集,则直接将 input 原样返回
     * ╚════════════════════════════════════════════════════════════════════════════════════════════
     */
    public static String decode(String input, String charset) {
        try {
            return URLDecoder.decode(input, charset);
        } catch (UnsupportedEncodingException e) {
            return input;
        }
    }

}
